Repository: Slipfaith/tmragger
Catalog: sample-tmx/HW_Marketing_RU-EN_repaired_repaired_repaired.tmx
Source language: ru_ru
Languages: en_us

source: Обменивай Луговые Монеты на уникальные подарки в специальном магазине
en_us: Exchange Meadow Coins for unique gifts in the special shop.

source: Недостаточно Луговых монет
en_us: Not enough Meadow Coins.

source: Выполняй задания, чтобы получить Луговые Монеты
en_us: Complete tasks to earn Meadow Coins.

source: Луговая Лавка
en_us: Meadow Shop

source: Принимай участие в событии "Пробуждение Природы"
en_us: Take part in the "Nature's Awakening" event.

source: Испытай удачу и выиграй призы!
en_us: Try your luck and win prizes!

source: Каждая попытка — уникальный трофей!
en_us: Every attempt brings a unique trophy!

source: Испытай удачу и выиграй призы в новом событии!
en_us: Try your luck and win prizes in the new event!

source: За Капли Пунша ты можешь выиграть талисманы, облики, уникальные предметы для Руфуса и многие другие потрясающие призы!
en_us: Use Punch Drops to win talismans, skins, exclusive items for Rufus, and many other fantastic rewards!

source: Кроме того, некоторые трофеи доступны только во время этого события.
en_us: Plus, some trophies are only available during this event.

source: Успей сорвать куш и сделать любимых героев еще сильнее!
en_us: Don't miss your chance to hit the jackpot and make your favorite heroes even stronger!

source: За Капли Пунша ты можешь выиграть талисманы, облики, предметы для Руфуса и многие другие потрясающие призы!
en_us: Use Punch Drops for a chance to win Talismans, skins, items for Rufus, and many other amazing rewards!

source: Опробуй обновленного Руфуса!
en_us: Try out Rufus' updated skills!

source: Захватывающие уровни и могущественные боссы ждут!
en_us: Exciting levels and powerful bosses await!

source: Прими участие в фестивале драк и веселья и испытай обновленного Руфуса в эпичных битвах!
en_us: Join the Festival of Fights and Fun and try out Rufus' updated skills in epic battles!

source: Наноси урон и побеждай!
en_us: Deal damage and win!

source: Опробуй обновленного Руфуса и устрой незабываемую заварушку!
en_us: Try out Rufus' updated skills and wreak unforgettable havoc!

source: Время крепких кулаков и задорного пиршества!
en_us: Time to use your fists and have a lively feast!

source: Прими участие в фестивале драк и веселья и испытай обновленного Руфуса в сражениях!
en_us: Join the Festival of Fights and Fun and try out Rufus' updated skills in battles!

source: Тебя ждут непростые уровни, могущественные боссы и захватывающие вызовы, а также особые предложения в магазине специально для рыжего балагура.
en_us: There will be plenty of tough levels, powerful bosses, and exciting challenges. And don't miss out on special offers in the shop—all in honor of the merry red-haired drunkard!

source: Успей как следует повеселиться, пока праздник не закончился!
en_us: Make sure to have lots of fun while the Festival lasts!

source: Насыщенное обновление!
en_us: An Eventful Update!

source: Сладкая помощь
en_us: Sweet Relief

source: Пир горой и тайна на закуску!
en_us: A lavish feast—and a mystery for dessert!

source: Отправляйся на фестиваль, где тебя ждут веселье, вкусные угощения и трофеи.
en_us: Join the festival of fun, tasty treats, and trophies.

source: Обновленный Руфус
en_us: Rufus Rework

source: Руфус стал еще надежнее!
en_us: Rufus has become even more reliable!

source: Теперь он укроет союзников не только от магии, но и от чистого урона!
en_us: Now, he can protect allies not just from magic, but from pure damage as well!

source: Сокровище Золотого Клевера
en_us: Golden Clover Treasure

source: Вырасти с гильдией самое высокое Древо Волшебства и получи уникальные призы.
en_us: Grow the tallest Magic Tree with your Guild and get unique rewards.

source: Календарь Лепрекотиков
en_us: Leprecat Calendar

source: Лепрекотики уже готовы раздавать подарки!
en_us: Leprecats are ready to give away their gifts!

source: Заходи в игру каждый день, чтобы собрать их все.
en_us: Log in every day to collect them all.

source: Повеселись на славу!
en_us: Enjoy yourself to the fullest!

source: Сезон цветущей сакуры
en_us: Sakura Season

source: Окунись в чарующую атмосферу весны!
en_us: Immerse yourself in the enchanting spring atmosphere!

source: Город утопает в цветах сакуры!
en_us: The city is overflowing with sakura flowers!

source: Встречай новые облики, тематические призы в боевом пропуске и изысканное оформление игры!
en_us: Check out new skins, themed Battle Pass prizes, and exquisite visuals!

source: Начинается сезон цветущей сакуры — окунись в чарующую атмосферу весны!
en_us: Sakura Season is starting. Immerse yourself in the enchanting spring atmoshpere!

source: Город утопает в лепестках сакуры!
en_us: The city is overflowing with sakura petals!

source: Тебя ждут новые утонченные облики, тематические призы в боевом пропуске и изысканное оформление игры!
en_us: New refined skins, themed Battle Pass prizes, and exquisite visuals await!

source: Насладись всеми сюрпризами сезона и прочувствуй волшебный дух перемен!
en_us: Enjoy all the surprises of the season and feel the magical spirit of change!

source: Лови рок-волну!
en_us: Ride the rock wave!

source: Получи бунтарские облики Сатори и Кейлы!
en_us: Get rebellious skins for Satori and Kayla!

source: Преврати Сатори и Кейлу в настоящих рок-звезд с новыми обликами!
en_us: Transform Satori and Kayla into real rock stars with new skins!

source: А улучшенный облик Сатори удваивает магический крит!
en_us: And Satori’s upgraded skin doubles his magic crit!

source: Лови рок-волну с новыми бунтарскими обликами для Сатори и Кейлы!
en_us: Ride the rock wave with new rebellious skins for Satori and Kayla!

source: Преврати Сатори и Кейлу в крутых рок-звезд Доминиона!
en_us: Transform Satori and Kayla into awesome Dominion rock stars!

source: У тебя всего три дня чтобы заполучить эти яркие облики для своих героев.
en_us: You have three days to secure these sweet skins for your Heroes.

source: А еще ты можешь дополнительно улучшить облик Сатори, удвоив его магический крит.
en_us: You can also upgrade Satori’s skin, doubling his magic crit.

source: Доступно с 15-го уровня!
en_us: Available starting at level 15!

source: Счастливая рука: Испытай себя!
en_us: Lucky hand: test yourself!

source: Выигрывай щедрые призы в режиме "Игра провидицы"!
en_us: Win lavish prizes in the “Seer's Game” mode!

source: Мама Чаббы предсказывает: тебя ждет успех!
en_us: Chabba’s mom foretells success for you!

source: Тяни карты, чтобы проверить свою удачу и выиграть крутые призы!
en_us: Pick cards to test your luck and win awesome prizes!

source: Играй в новую мини-игру, выигрывай призы и получай в 4 раза больше изумрудов!
en_us: Play the new minigame, win prizes, and earn 4 times as many emeralds as usual!

source: Тебя ждет успех!
en_us: Success awaits you!

source: Тяни карты в новом режиме "Игра провидицы", чтобы проверить свою удачу и выиграть призы!
en_us: Pick cards in the new “Seer's Game” mode to test your luck and win prizes!

source: Кроме того, тебя ждут выгодные акции: в 4 раза больше изумрудов за выполнение заданий, бонусы за покупку изумрудов и множество других наград!
en_us: There are also some great deals for you: 4 times as many emeralds for completing tasks, bonuses for purchasing emeralds, and various other rewards!

source: Врывайся в неделю крутых акций и событий!
en_us: Onwards, into a week of awesome deals and events!

source: Бунтарское обновление!
en_us: A rebellious update!

source: Изменение баланса Сатори
en_us: Satori rebalanced

source: Великий маг Лисьего Огня стал еще сильнее!
en_us: The great Fox Fire mage has become even more powerful!

source: Испытай новые возможности Сатори в деле и покажи всем, что с этим лисом шутки плохи!
en_us: Try out Satori’s new abilities and show everybody that they shouldn’t mess with this fox!

source: Маскарадные облики
en_us: Masquerade Skins

source: Кейла, Эйден и Сатори готовы зажигать на сцене!
en_us: Kayla, Aidan, and Satori are ready to rock out onstage!

source: Новые броские облики подчеркнут их стиль и превратят в настоящих рок-звезд Доминиона.
en_us: New fabulous skins will bring out their style and turn them into true Dominion rock stars.

source: А наряд Сатори можно дополнительно улучшить — все софиты на него!
en_us: And Satori’s outfit can be further upgraded — all stage lights on him!

source: Пора устроить переполох на поле боя!
en_us: It’s time to cause some mayhem on the battlefield!

source: Время сиять!
en_us: Time to shine!

source: Полярная звезда Новая героиня выбралась из ледяного плена, чтобы сковать врагов морозной магией!
en_us: The Polar Star A new heroine has risen out of her frozen captivity to pin down enemies with freezing magic!

source: Даже те, кто не знал страха, дрогнут перед ледяным взглядом Полярис... Отпустить и забыть?
en_us: Even those who know no fear tremble before Polaris’s icy glare... Forgive and forget?

source: Нет уж.
en_us: Not a chance.

source: Ее путь — сражаться и побеждать!
en_us: She prefers to fight and win!

source: Новые талисманы Что общего у котика, изобретателя и грибного дуэта?
en_us: New Talismans What do a cat, an inventor, and a mushroom duo have in common?

source: Новые талисманы!
en_us: New talismans!

source: Это не просто стильные побрякушки — с ними Муши и Шрум, Юлиус и Айзек переживут любую бурю.
en_us: These aren't just stylish trinkets. Mushy and Shroom, Julius, and Isaac can use them to weather any storm.

source: Новый герой, новые возможности — новые победы!
en_us: New Hero, new abilities... and new victories!

source: Какие тайны скрывает прошлое?
en_us: What secrets hide in the past?

source: Участвуй в новом приключении с Ларсом и Кристой!
en_us: Take part in a new adventure with Lars and Krista!

source: Отправься на родину Ларса и Кристы, одолей могучих боссов и выясни, почему героев разлучили еще в детстве!
en_us: Go to Lars and Krista's homeland, beat powerful bosses, and find out why the heroes were separated at birth!

source: Участвуй в новом загадочном приключении с Ларсом и Кристой!
en_us: Take part in a mysterious new adventure with Lars and Krista!

source: В поисках ответов о прошлом Ларс и Криста отправляются на родину своих предков, вот только цена истины высока — сумеют ли герои заплатить ее?
en_us: In search of answers, Lars and Krista head to their ancestral homeland, but the price for the truth is steep. Can the heroes pay it?

source: Прими участие в новом приключении и узнай!
en_us: Take part in the new adventure and find out!

source: Тебя ждут десятки уникальных уровней с могучими боссами, сложные решения и страшная тайна о том, почему Ларса и Кристу разлучили еще в детстве!
en_us: Get ready for dozens of unique levels with powerful bosses, difficult decisions, and the chilling mystery of why Lars and Krista were separated at birth!

source: Праздник Весны в Доминионе!
en_us: The Dominion Spring Festival!

source: Пополняй припасы и становись сильнее!
en_us: Refill your supplies and become stronger!

source: Во время события тебя ждут выгодные предложения, души для стражей фракции Чести и другие полезные ресурсы!
en_us: During the event, there will be great deals, souls for the Guardians of the Way of Honor, and other useful resources!

source: Скидки до 65% — пополни припасы по выгодной цене и стань еще сильнее!
en_us: Discounts up to 65%—refill your supplies for a great price and become stronger!

source: Во время события тебя ждут скидки до 55% на сундуки и до 65% на товары в карусели, а еще в 4 раза более выгодные предложения изумрудов!
en_us: During the event, chests will be discounted up to 55%, featured items—up to 65%, and offers on emeralds will be x4 in value!

source: Также доступны души для стражей фракции Чести — не упусти шанс усилить команду!
en_us: Souls for the Guardians of the Way of Honor will also be available—don’t miss out on a chance to upgrade your team!

source: Неземное обновление!
en_us: An unearthly update!

source: Новые облики В легких небесных нарядах Айрис, Солей и Артемис вмиг воспарят к героической славе!
en_us: New skins In these light, heavenly outfits, Iris, Soleil, and Artemis will instantly soar to heroic glory!

source: А облик Артемис можно дополнительно улучшить в магазине — никому не сбежать от ее точеных стрел!
en_us: You can also upgrade Artemis’ skin in the shop. No one will be able to escape her deadly arrows!

source: Искусная лучница Помимо нового облика Артемис получила обновление характеристик: ее способности стали куда смертоноснее!
en_us: Master Marksman Along with her new skin, Artemis has gotten a stats upgrade. Her abilities have become even more dangerous!

source: Испытай усиленную охотницу на поле боя!
en_us: Try out the upgraded hunter on the battlefield!

source: Покоряй новые высоты!
en_us: Conquer new heights!

source: Раскрой тайны Востока!
en_us: Uncover East’s Mysteries!

source: Получи новые восточные облики Солея и Артемис!
en_us: Get new Lunar Skins for Soleil and Artemis!

source: Преврати Солея и Артемис в оружие, смертоносное как самурайский меч!
en_us: Turn Soleil and Artemis into weapons as deadly as a samurai sword!

source: Поторопись — событие продлится всего три дня!
en_us: Hurry—the event will only last for three days!

source: Всего три дня в магазине будут доступны эффектные восточные облики, а уникальный супероблик Артемис позволит тебе удвоить ее Здоровье.
en_us: Only for three days, the shop will offer fabulous Lunar Skins, and the unique Superskin for Artemis will allow you to double her Health.

source: Успей забрать!
en_us: Don’t miss out—get it!

source: Стань героем Мифов Доминиона!
en_us: Be a hero of Dominion myths!

source: Получи мифические облики Пич и Темной Звезды!
en_us: Get mythic Skins for Peech and Dark Star!

source: Преврати Пич и Темную Звезду в греческих богинь с новыми обликами!
en_us: Turn Peech and Dark Star into Greek goddesses with new Skins!

source: А супероблик Пич в 2 раза увеличивает ее Сокрушение!
en_us: And a Superskin for Peech doubles her Crushing!

source: Легенды гласят: в Доминионе восстали богини — Пич и Темная Звезда!
en_us: Legends say: two goddesses have risen in Dominion—Peech & Dark Star!

source: Надень на них мифические облики, пробуди древнюю силу и бей врагов без пощады.
en_us: Clad them in mythic Skins and slay your enemies without mercy.

source: Поторопись — событие продлится всего 3 дня!
en_us: Hurry—the event will be on for only 3 days!

source: Пробуждение природы!
en_us: Nature awakens!

source: Призыватель Земли Вместе с первой травой из земли восстал новый титан!
en_us: Earth Summoner A new Titan rises from the ground along with fresh grass!

source: Добавь Вердока в команду и сокрушай даже самых стойких врагов!
en_us: Add Verdoc to your team and crush even the most resilient foes!

source: Лед и молния Весна придала Ларсу и Кристе свежих сил: их обновленные способности стали куда смертоноснее!
en_us: Ice and Lightning Spring has given Lars and Krista new strength—their updated skills are much deadlier now!

source: Испытай усиленную магию близнецов на поле боя!
en_us: Test the enhanced magic of the twins in battle!

source: Обновленный облик орков Чудовища сменили шкуры и теперь выглядят еще более дико!
en_us: A New Look for Orcs Monsters have shed their old skins and look even wilder now!

source: Взгляни на новых орков своими глазами.
en_us: See the new orcs with your own eyes.

source: Если осмелишься... Обрушь на врагов первобытные силы!
en_us: If you dare... Bring down the primal forces upon your enemies!

source: Враги атакуют.
en_us: Enemies attack.

source: Освободи город!
en_us: Free the city!

source: Битвы, трофеи и яркие эмоции с первых минут!
en_us: Battles, trophies, and excitement from the get go!

source: Отправляйся с Галахадом в интерактивное путешествие!
en_us: Set off on an interactive journey with Galahad!

source: Тебя ждут уникальная карта, захватывающий сюжет и напряженные бои!
en_us: A unique map, captivating story, and intense battles await!

source: Огры и демоны атакуют!
en_us: Ogres and demons are attacking!

source: Главная площадь Доминиона полна событий и испытаний, но сперва нужно пробраться к ней!
en_us: The Main Square of Dominion is full of events and challenges, but first you need to reach it!

source: Отправляйся с Галахадом в интерактивное путешествие по новой карте: исследуй локации, освободи Аврору, сразись с ограми и демонами.
en_us: Set off on an interactive journey through the new map with Galahad. Explore locations, free Aurora, fight ogres and demons.

source: Выполняй задания, участвуй в эпичных боях и спаси осажденный город!
en_us: Complete quests, participate in epic battles, and save the besieged city!

source: Новый LiveOps для новичков
en_us: New LiveOps for New Users

source: Узнай легенду золотого гуся!
en_us: Meet the new Hero—Guus!

source: Получи нового героя-целителя Гаса и его друга!
en_us: Obtain the new healer Hero Guus and his friend!

source: Отправляйся в увлекательное приключение с Гасом и его волшебным гусем, и стань героем этой истории!
en_us: Set off on a fascinating adventure with Guus and his magic goose, and become the hero of this tale!

source: Получи нового героя-целителя Гаса и узнай легенду о его спутнике — золотом гусе!
en_us: Get the new healer Hero Guus and learn the tale of his companion—a golden goose!

source: Отправляйся в приключения с Гасом и его верным гусем!
en_us: Set off on an adventure with Guus and his trusty goose!

source: Тебя ждут жаркие битвы с боссами, сложные моральные выборы и трогательная история дружбы, силы и судьбы.
en_us: Intense boss battles, moral dilemmas, and a touching story of friendship, strength and fate await you.

source: Пройди десятки уровней, испытай целительские таланты нового Стража в битвах против боссов и помоги ему стать настоящим героем!
en_us: Beat dozens of levels, test the new Guardian’s healing talents in fights against bosses, and help him become a true hero!

source: Изумрудная лихорадка!
en_us: The Emerald Fever!

source: Забирай щедрые лоты и готовь титанов к Турниру!
en_us: Get great offers & prepare for the Tournament!

source: Хватай изумруды каждый день и получай максимум выгоды!
en_us: Grab emeralds every day & get maximum value!

source: А заодно усиливай титанов, чтобы победить в Турнире мощи!
en_us: And while you’re at it, upgrade your Titans to win the Tournament of Power!

source: Акция х4 на все предложения изумрудов!
en_us: Get x4 emeralds from all offers!

source: Закупайся и готовь титанов к Турниру!
en_us: Shop & prepare your Titans for the Tournament!

source: Заходи в игру каждый день и получай в 4 раза больше изумрудов с каждого лота!
en_us: Launch the game every day and get 4 times the emeralds from any offer!

source: Запасайся ресурсами, усиливай героев и участвуй в Турнире мощи титанов.
en_us: Stock up on resources, upgrade your Heroes, and participate in the Tournament of Titan Power.

source: Заработай как можно больше очков за рост силы героев и приведи свою группу к победе!
en_us: Get the best score you can for growing the strength of your Heroes and lead your group to victory!

source: Эпичное обновление!
en_us: An Epic Update!

source: Дочери Зевса Новые мифические облики превратят Пич и Темную звезду в греческих богинь!
en_us: Daughters of Zeus New mythological skins will turn Peech & Dark Star into Greek goddesses!

source: А наряд Пич можно дополнительно улучшить — так ей станет вдвое проще сокрушать врагов!
en_us: Peech’s outfit can also be upgraded to make it twice as easy for her to crush enemies!

source: Лики зла Приготовься к встрече с преображенными демонами!
en_us: Faces of Evil Get ready to meet reimagined demons!

source: Пусть их величественный вид не обманет тебя: внутри они такие же подлые, как и раньше!
en_us: Don’t let their magnificent appearances fool you: inside, they're just as evil as before!

source: Новости арены Теперь чем выше твоя лига, тем больше рейтинга останется у тебя после сброса в конце сезона!
en_us: Arena News Now, the higher your league, the higher your rank will stay after the season-end reset!

source: Впиши свое имя в легенды Доминиона!
en_us: Inscribe your name in the history books of the Dominion!

source: Стань сильнее вместе с Пич!
en_us: Get stronger with Peech!

source: Запасайся ресурсами и приумножай свою мощь!
en_us: Stock up on resources and increase your might!

source: Тебя ждут увлекательные задания, выгодные предложения, а также возможность приобрести души Пич и героев пути Хаоса!
en_us: Captivating quests, deals, and an opportunity to buy souls for Peech and the Heroes of the Way of Chaos await!

source: Скидки до 65% и в четыре раза больше ресурсов — приумножь свою мощь!
en_us: Discounts up to 65% and four times more resources! Increase your might!

source: Сумасшедшая распродажа в Доминионе — не упусти возможность приобрести души Пич и героев пути Хаоса!
en_us: A crazy sale in Dominion! Don’t miss an opportunity to buy souls for Peech and the Heroes of the Way of Chaos!

source: Тебя ждут скидки до 55% на сундуки и до 65% на товары в карусели, а также в 4 раза больше ресурсов с каждого лота!
en_us: Chests discounts up to 55% and featured items discounts up to 65%, as well as 4 times more resources from any offer are waiting for you!

source: Стань сильнее и преврати битву с врагами в настоящее шоу — для преданных фанатов Пич подготовила две аватарки и стильную цирковую рамку!
en_us: Become stronger and turn battles with your enemies into a true show—for the most dedicated fans Peech has prepared two avatars and a stylish circus frame!

source: ru_ru
en_us: en_us

source: Новые облики!
en_us: New Skins!

source: Герой мифов К пантеону греческих богов присоединяется Себастьян!
en_us: Hero of Myth Sebastian joins the pantheon of Greek gods!

source: Не упусти возможность приобрести новый мифический облик для этого обаятельного музыканта!
en_us: Don’t miss the chance to buy a new Mythical Skin for this charming musician!

source: Герой спортзала Посмотри-ка, Тристан не терял времени зря и подкачался к лету: статный, мускулистый, а главное — стильный!
en_us: Hero of the Gym Hey, it seems Tristan got busy and really worked on his beach bod! He’s well handsome, muscular, and—most importantly—stylish!

source: Да-да, это все новый спортивный облик — скорее добавь его в свою коллекцию!
en_us: Oh yeah, it must be his new Sport Skin. Hurry and add it to your collection!

source: Преобрази героев и переверни ход боя!
en_us: Transform your Heroes and turn the tide of battle!

source: Изобилие изумрудов!
en_us: Emeralds Galore!

source: Самое время пополнить запасы ценной валюты!
en_us: It's time to stock up on this valuable currency!

source: Каждый день тебя ждут щедрые предложения изумрудов!
en_us: Generous Emerald offers every day!

source: Получи максимум выгоды и подготовься к будущим приключениям!
en_us: Get the best value and get ready for future adventures!

source: В 4 раза больше изумрудов с каждого лота — время пополнить свои запасы!
en_us: 4 times more Emeralds with every lot! Time to stock up!

source: Не пропусти акцию х4 на все лоты изумрудов!
en_us: Don't miss out on the x4 offer on all Emerald lots!

source: Предложения обновляются каждый день — заходи в игру и получай четырехкратную выгоду!
en_us: Offers refresh every day. Log in to the game and get quadruple value!

source: Пополни запасы изумрудов, чтобы открывать сундуки, покупать энергию для кампаний, улучшать своих героев и встречать новые приключения во всеоружии!
en_us: Stock up on Emeralds to unlock chests, buy Energy for campaigns, upgrade your Heroes, and get fully armed for new adventures!

source: Получи новые ангельские облики
en_us: Get New Angelic Skins

source: Надели Альванора и Темпуса неземной силой!
en_us: Give Alvanor and Tempus heavenly powers!
